Hi, sorry, but I cant reproduce this error, on this module I dont use configurartion versiones, because of this, I recreate the full configuration and delete prior config, In my computer if I change properties I get something like:

```
 # module.simple.aws_msk_cluster.this will be updated in-place
  ~ resource "aws_msk_cluster" "this" {
        id                       = "arn:aws:kafka:eu-west-2:342631421827:cluster/simple/5c07d788-791a-4239-b92f-0b3a1c47ce41-3"
        tags                     = {}
        # (10 unchanged attributes hidden)


      ~ configuration_info {
          ~ arn      = "arn:aws:kafka:eu-west-2:342631421827:configuration/simple-2940432070742172855/884bfe18-c47b-485b-85e2-82fe948ba7e4-3" -> (known after apply)
            # (1 unchanged attribute hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.simple.aws_msk_configuration.this must be replaced
+/- resource "aws_msk_configuration" "this" {
      ~ arn               = "arn:aws:kafka:eu-west-2:342631421827:configuration/simple-2940432070742172855/884bfe18-c47b-485b-85e2-82fe948ba7e4-3" -> (known after apply)
      ~ id                = "arn:aws:kafka:eu-west-2:342631421827:configuration/simple-2940432070742172855/884bfe18-c47b-485b-85e2-82fe948ba7e4-3" -> (known after apply)
      ~ latest_revision   = 1 -> (known after apply)
      ~ name              = "simple-2940432070742172855" -> (known after apply) # forces replacement
      ~ server_properties = "default.replication.factor = 3" -> "default.replication.factor = 2"
        # (1 unchanged attribute hidden)
    }

  # module.simple.random_id.configuration must be replaced
+/- resource "random_id" "configuration" {
      ~ b64_std     = "simple-KM6DY6bA5Lc=" -> (known after apply)
      ~ b64_url     = "simple-KM6DY6bA5Lc" -> (known after apply)
      ~ dec         = "simple-2940432070742172855" -> (known after apply)
      ~ hex         = "simple-28ce8363a6c0e4b7" -> (known after apply)
      ~ id          = "KM6DY6bA5Lc" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "server_properties" = "default.replication.factor = 3" -> "default.replication.factor = 2"
        }
        # (2 unchanged attributes hidden)
    }
```
And it changes the configuration info arn.

Please could you help me to understand where the error is?

Thanks for your info!

